In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('df_n1.csv')
df2 = pd.read_csv('df_n2.csv')

In [3]:
df1

     ID     Name        Date  Amount
0  A001    Sunil  01-01-2016     100
1  A003     Mani  01-05-2015     476
2  A006  Karthik  03-05-2015     454
3  A007    Muthu  13-08-2017     333
4  A008     Loga  22-09-2017     456
5  A009     Guna  15-11-2019     234
6  A010    Rajiv  23-10-2018     456
7  A014  Prasath  10-08-2017     567
8  A020   Udhaya  12-04-2018     678
9  A022     Velu  24-05-2019     789

In [4]:
df2

     ID    Name        Date   Amount
0  A006    Vino  03-05-2015     1000
1  A008    Ragu  22-09-2017    20000
2  A010  Barath  23-10-2018   100000
3  A003    Mani  01-05-2015  1000000
4  A020   Kumar  12-04-2018    40000

sort based on Date < or >  or = 

Match ID and Date from Df2 and df1 
update name and amount

change amount value from df2 to df1 
or 
delete or insert scenario

In [10]:
for id1, name1 in df1[['ID', 'Name']].values:
    for id2, name2 in df2[['ID', 'Name']].values:
        if id1 == id2:
            if name1 == name2 :
                print(df2[df2['Name'] == name2])
                print(df1[df1['Name'] == name1])

     ID  Name        Date   Amount
3  A003  Mani  01-05-2015  1000000
     ID  Name        Date  Amount
1  A003  Mani  01-05-2015     476

In [15]:
df1['Date'] = pd.to_datetime(df1['Date'])

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
ID        10 non-null object
Name      10 non-null object
Date      10 non-null datetime64[ns]
Amount    10 non-null int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 400.0+ bytes

In [24]:
tmp_df = df1.set_index('Date')

In [26]:
from datetime import datetime as dt

In [27]:
dt.now()

datetime.datetime(2020, 2, 23, 20, 17, 24, 702609)

In [32]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
ID        10 non-null object
Name      10 non-null object
Date      10 non-null datetime64[ns]
Amount    10 non-null int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 400.0+ bytes

In [42]:
D = [2017, 2018, 2016]


for i in D:
    df1[df1['Date'] < str(i)]